stars = ['Солнце']
planets = ['Меркурий', 'Венера', 'Земля', 'Марс', 'Юпитер', 'Сатурн', 'Уран', 'Нептун']
asteroids = ['Церера', 'Паллада', 'Веста']
dwarfs = ['Плутон', 'Макемаке', 'Хаумеа', 'Квавар', 'Гунгун', 'Седна']
satellites = ['Луна', 'Фобос', 'Деймос', 'Ганимед', 'Европа', 'Ио', 'Каллисто', 'Титан', 'Энцелад', 'Титания', 'Тритон', 'Харон']
print('Напиши объект Солнечной системы, а я назову, что это.')
x = input()
while len(x)> 0:
	if x in stars:
		print('Это звезда.')
	elif x in planets:
		print('Это планета.')
	elif x in dwarfs:
		print('Это карликовая планета.')
	elif x in asteroids:
		print('Это астериод.')
	elif x in satellites:
		print('Это спутник.')
	else:
		print('Такое я не знаю...')
	print('Ещё напиши.')
	x = input()
		