print("ЕСТЬ ЛИ В НАШЕМ ЗООПАРКЕ? \nНапишите животное (в единственном числе)")
print()
row = ["трубкозуб", "ленивец", "броненосец", "попугай", "ара", "какаду", "корелла", "жако", "турако", "орёл", "орлан", "балобан", "полярная сова", "гриф", "канюк", "сип", "стервятник", "цесарка", "мандаринка", "утка", "гусь", "лебедь", "аист", "пеликан", "фламинго", "журавль", "павлин", "рогатый ворон", "сова", "филин", "эму", "кенгуру", "курица", "петух", "индюк", "нанду", "тапир", "верблюд", "бизон", "овца", "осёл", "коза", "олень", "козёл", "горный козёл", "винторогий козёл", "дагестанский тур", "уриал", "баран", "голубой баран", "дикобраз", "мара", "лама", "гуанако", "олень", "лев", "волк", "леопард", "рысь", "енот", "медведь", "бурый медведь", "сивуч", "морской лев", "тюлень", "выдра", "слон", "жираф", "страус", "капибара", "бегемот", "сурикат", "муравьед", "орангутан", "мандрил", "игрунка", "лемур", "макак", "гиббон", "колобус", "тамарин", "японский перепел", "питон", "удав", "кайман", "черепаха", "пиранья", "скат", "акула", "кошачья акула", "мурена", "рыба", "паку", "карп", "карп кои", "палочник", "таракан", "мадагаскарский таракан", "мёртвая голова", "таракан мёртвая голова"]
x = str(input())
if x in row:
	print("есть!")
else:
	print("нету...")
x = str(input())
if x in row:
	print("есть!")
else:
	print("нету...")
x = str(input())
if x in row:
	print("есть!")
else:
	print("нету...")
x = str(input())
if x in row:
	print("есть!")
else:
	print("нету...")
x = str(input())
if x in row:
	print("есть!")
else:
	print("нету...")
x = str(input())
if x in row:
	print("есть!")
else:
	print("нету...")
x = str(input())
if x in row:
	print("есть!")
else:
	print("нету...")
x = str(input())
if x in row:
	print("есть!")
else:
	print("нету...")
i = str(input())